; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/ferry/domain.pddl
; updates: typing car and locations; sail precs have now (not (at-ferry ?to)) so (not-eq ?from ?to) can be removed
(define (domain ferry)
   (:requirements :typing :strips :negative-preconditions)
   (:types car - object 
           location - object)

   (:predicates
		(at-ferry ?l - location)
		(at ?c - car ?l - location)
		(empty-ferry)
		(on ?c - car))

   (:action sail
       :parameters  (?from - location ?to - location)
       :precondition (and (at-ferry ?from) (not (at-ferry ?to)))
       :effect (and  (at-ferry ?to) (not (at-ferry ?from))))

   (:action board
       :parameters (?car - car ?loc - location)
       :precondition (and (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
       :effect (and
            (on ?car)
		    (not (at ?car ?loc)) 
		    (not (empty-ferry))))

   (:action debark
       :parameters (?car - car  ?loc - location)
       :precondition (and (on ?car) (at-ferry ?loc))
       :effect (and
            (at ?car ?loc)
		    (empty-ferry)
		    (not (on ?car)))))

; problem
(define (problem ferry-60)
 (:domain ferry)
 (:objects 
    car1 car2 car3 car4 car5 car6 car7 car8 car9 car10 car11 - car
    loc1 loc2 loc3 loc4 loc5 loc6 loc7 loc8 loc9 loc10 loc11 - location
 )
 (:init 
    (empty-ferry)
    (at-ferry loc4)
    (at car1 loc2)
    (at car2 loc8)
    (at car3 loc11)
    (at car4 loc10)
    (at car5 loc10)
    (at car6 loc5)
    (at car7 loc11)
    (at car8 loc6)
    (at car9 loc8)
    (at car10 loc10)
    (at car11 loc5)
)
 (:goal (and 
(at car1 loc6)
(at car2 loc9)
(at car3 loc5)
(at car4 loc6)
))
)

; plan
1. (sail loc4 loc11)
   deleted: (at-ferry loc4)
   added: (at-ferry loc11)
   goals met: 0 of 4
2. (board car3 loc11)
   deleted: (at car3 loc11) (empty-ferry)
   added: (on car3)
   goals met: 0 of 4
3. (sail loc11 loc5)
   deleted: (at-ferry loc11)
   added: (at-ferry loc5)
   goals met: 0 of 4
4. (debark car3 loc5)
   deleted: (on car3)
   added: (at car3 loc5) (empty-ferry)
   goals met: 1 of 4
5. (sail loc5 loc8)
   deleted: (at-ferry loc5)
   added: (at-ferry loc8)
   goals met: 1 of 4
6. (board car2 loc8)
   deleted: (at car2 loc8) (empty-ferry)
   added: (on car2)
   goals met: 1 of 4
7. (sail loc8 loc9)
   deleted: (at-ferry loc8)
   added: (at-ferry loc9)
   goals met: 1 of 4
8. (debark car2 loc9)
   deleted: (on car2)
   added: (at car2 loc9) (empty-ferry)
   goals met: 2 of 4
9. (sail loc9 loc10)
   deleted: (at-ferry loc9)
   added: (at-ferry loc10)
   goals met: 2 of 4
10. (board car4 loc10)
   deleted: (at car4 loc10) (empty-ferry)
   added: (on car4)
   goals met: 2 of 4
11. (sail loc10 loc6)
   deleted: (at-ferry loc10)
   added: (at-ferry loc6)
   goals met: 2 of 4
12. (debark car4 loc6)
   deleted: (on car4)
   added: (at car4 loc6) (empty-ferry)
   goals met: 3 of 4
13. (sail loc6 loc2)
   deleted: (at-ferry loc6)
   added: (at-ferry loc2)
   goals met: 3 of 4
14. (board car1 loc2)
   deleted: (at car1 loc2) (empty-ferry)
   added: (on car1)
   goals met: 3 of 4
15. (sail loc2 loc6)
   deleted: (at-ferry loc2)
   added: (at-ferry loc6)
   goals met: 3 of 4
16. (debark car1 loc6)
   deleted: (on car1)
   added: (at car1 loc6) (empty-ferry)
   goals met: 4 of 4
